In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series([0.25, 0.5, 0.56, 0.75],
               index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.56
d    0.75
dtype: float64

In [3]:
data['b']

0.5

In [4]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.56), ('d', 0.75)]

In [6]:
data['e'] = 1
data

a    0.25
b    0.50
c    0.56
d    0.75
e    1.00
dtype: float64

In [7]:
#slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.56
dtype: float64

In [8]:
#slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [9]:
#masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.56
d    0.75
dtype: float64

In [10]:
#fancy indexing
data[['a', 'e']]

a    0.25
e    1.00
dtype: float64

In [14]:
pop = pd.Series({'Embakassi': 365746,
                   'Donholm': 45689,
                   'Rongai': 234789,
                   'Imaara Daima': 56789,
                   'Ruiru': 874563})
area = pd.Series({'Embakassi': 48903, 'Donholm': 12345, 'Rongai': 54672, 'Imaara Daima': 2345,
             'Ruiru': 67589})
data = pd.DataFrame({'area': area, 'pop': pop})
data

               area     pop
Embakassi     48903  365746
Donholm       12345   45689
Rongai        54672  234789
Imaara Daima   2345   56789
Ruiru         67589  874563

In [15]:
#dictionary style indexing
data['area']

Embakassi       48903
Donholm         12345
Rongai          54672
Imaara Daima     2345
Ruiru           67589
Name: area, dtype: int64

In [16]:
#attribute-style access with string column names
data.area

Embakassi       48903
Donholm         12345
Rongai          54672
Imaara Daima     2345
Ruiru           67589
Name: area, dtype: int64

In [18]:
#modifying the object (adding new column)
data['density'] = data['pop'] / data['area']
data

               area     pop    density
Embakassi     48903  365746   7.479009
Donholm       12345   45689   3.701013
Rongai        54672  234789   4.294502
Imaara Daima   2345   56789  24.217058
Ruiru         67589  874563  12.939428

In [19]:
#DataFrame as 2D array
data.values

array([[4.89030000e+04, 3.65746000e+05, 7.47900947e+00],
       [1.23450000e+04, 4.56890000e+04, 3.70101256e+00],
       [5.46720000e+04, 2.34789000e+05, 4.29450176e+00],
       [2.34500000e+03, 5.67890000e+04, 2.42170576e+01],
       [6.75890000e+04, 8.74563000e+05, 1.29394280e+01]])

In [20]:
#Transposing (swap DataFrame rows and columns)
data.T

,Embakassi,Donholm,Rongai,Imaara Daima,Ruiru
area,48903.000000,12345.000000,54672.000000,2345.000000,67589.000000
pop,365746.000000,45689.000000,234789.000000,56789.000000,874563.000000
density,7.479009,3.701013,4.294502,24.217058,12.939428

In [21]:
data.iloc[:3 :2]

            area     pop   density
Embakassi  48903  365746  7.479009
Rongai     54672  234789  4.294502

In [22]:
data.T

,Embakassi,Donholm,Rongai,Imaara Daima,Ruiru
area,48903.000000,12345.000000,54672.000000,2345.000000,67589.000000
pop,365746.000000,45689.000000,234789.000000,56789.000000,874563.000000
density,7.479009,3.701013,4.294502,24.217058,12.939428

In [23]:
data.T

,Embakassi,Donholm,Rongai,Imaara Daima,Ruiru
area,48903.000000,12345.000000,54672.000000,2345.000000,67589.000000
pop,365746.000000,45689.000000,234789.000000,56789.000000,874563.000000
density,7.479009,3.701013,4.294502,24.217058,12.939428

In [24]:
data.loc[:'Donholm', : 'pop']

            area     pop
Embakassi  48903  365746
Donholm    12345   45689